БСП_2_4_5/src/Catalogs/НаборыДополнительныхРеквизитовИСведений/НаборыДополнительныхРеквизитовИСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыДополнительныхРеквизитовИСведений</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Справочник__ДемоКонтрагенты</name>
      <description>Демо: Контрагенты</description>
    </items>
    <items>
      <name>Справочник__ДемоПартнеры</name>
      <description>Демо: Партнер</description>
    </items>
    <items>
      <name>Справочник__ДемоНоменклатура</name>
      <description>Демо: Позиция номенклатуры</description>
    </items>
    <items>
      <name>Справочник_ВнешниеПользователи</name>
      <description>Внешние пользователи</description>
    </items>
    <items>
      <name>Документ_Встреча</name>
      <description>Встреча</description>
    </items>
    <items>
      <name>Документ__ДемоСчетНаОплатуПокупателю</name>
      <description>Демо: Счета на оплату покупателям</description>
    </items>
    <items>
      <name>Документ_ЗапланированноеВзаимодействие</name>
      <description>Запланированное взаимодействие</description>
    </items>
    <items>
      <name>Справочник_ПапкиФайлов</name>
      <description>Папка</description>
    </items>
    <items>
      <name>Справочник_Пользователи</name>
      <description>Пользователи</description>
    </items>
    <items>
      <name>Документ_СообщениеSMS</name>
      <description>Сообщение SMS</description>
    </items>
    <items>
      <name>Документ_ТелефонныйЗвонок</name>
      <description>Телефонный звонок</description>
    </items>
    <items>
      <name>УдалитьСправочник__ДемоКонтрагенты</name>
      <description>Удалить Демо: Контрагент</description>
    </items>
    <items>
      <name>Справочник_Файлы</name>
      <description>Файл</description>
    </items>
    <items>
      <name>Документ_ЭлектронноеПисьмоВходящее</name>
      <description>Электронное письмо входящее</description>
    </items>
    <items>
      <name>Документ_ЭлектронноеПисьмоИсходящее</name>
      <description>Электронное письмо исходящее</description>
    </items>
  </predefined>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСведений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСведения</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БСП_2_4_5/src/Catalogs/НаборыДополнительныхРеквизитовИСведений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// Возвращает реквизиты объекта, которые разрешается редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обновляет состав наименований предопределенных наборов в
// параметрах дополнительных реквизитов и сведений.
// 
// Параметры:
//  ЕстьИзменения - Булево (возвращаемое значение) - если производилась запись,
//                  устанавливается Истина, иначе не изменяется.
//
Процедура ОбновитьСоставНаименованийПредопределенныхНаборов(ЕстьИзменения = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПредопределенныеНаборы = ПредопределенныеНаборы();
	
	НачатьТранзакцию();
	Попытка
		ЕстьТекущиеИзменения = Ложь;
		СтароеЗначение = Неопределено;
		
		СтандартныеПодсистемыСервер.ОбновитьПараметрРаботыПрограммы(
			"СтандартныеПодсистемы.Свойства.ПредопределенныеНаборыДополнительныхРеквизитовИСведений",
			ПредопределенныеНаборы, ЕстьТекущиеИзменения, СтароеЗначение);
		
		СтандартныеПодсистемыСервер.ДобавитьИзмененияПараметраРаботыПрограммы(
			"СтандартныеПодсистемы.Свойства.ПредопределенныеНаборыДополнительныхРеквизитовИСведений",
			?(ЕстьТекущиеИзменения,
			  Новый ФиксированнаяСтруктура("ЕстьИзменения", Истина),
			  Новый ФиксированнаяСтруктура()) );
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ЕстьТекущиеИзменения Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	
КонецПроцедуры

// _Демо начало примера

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбновляемыеОбъекты = Новый Массив;
	ОбновляемыеОбъекты.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник__ДемоКонтрагенты);
	ОбновляемыеОбъекты.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.УдалитьСправочник__ДемоКонтрагенты);
	ОбновляемыеОбъекты.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ДемоКонтрагенты_Основное);
	ОбновляемыеОбъекты.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ__ДемоСчетНаОплатуПокупателю);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеРеквизиты.Свойство КАК Свойство
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
		|ГДЕ
		|	ДополнительныеРеквизиты.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Свойство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеСведения.Свойство КАК Свойство
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Свойство";
	
	Запрос.УстановитьПараметр("Ссылка", Справочники.НаборыДополнительныхРеквизитовИСведений.УдалитьСправочник__ДемоКонтрагенты);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДополнительныеРеквизитыГруппы = РезультатЗапроса[0].Выгрузить().ВыгрузитьКолонку("Свойство");
	ДополнительныеСведенияГруппы  = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Свойство");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОбновляемыеОбъекты, ДополнительныеРеквизитыГруппы);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОбновляемыеОбъекты, ДополнительныеСведенияГруппы);
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ОбновляемыеОбъекты);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыНаборов = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	МассивНаборов = Новый Массив;
	МассивНаборов.Добавить("Справочник__ДемоКонтрагенты");
	МассивНаборов.Добавить("Справочник_ДемоКонтрагенты_Основное");
	МассивНаборов.Добавить("Справочник_ДемоКонтрагенты_Прочее");
	МассивНаборов.Добавить("Документ__ДемоСчетНаОплатуПокупателю");
	Для Каждого Набор Из МассивНаборов Цикл
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств(Набор, ПараметрыНаборов);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеРеквизиты.Свойство КАК Свойство
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
		|ГДЕ
		|	ДополнительныеРеквизиты.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Свойство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеСведения.Свойство КАК Свойство
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Свойство";
	
	Запрос.УстановитьПараметр("Ссылка", Справочники.НаборыДополнительныхРеквизитовИСведений.УдалитьСправочник__ДемоКонтрагенты);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДополнительныеРеквизитыГруппы = РезультатЗапроса[0].Выгрузить();
	ДополнительныеСведенияГруппы  = РезультатЗапроса[1].Выгрузить();
	
	Если ДополнительныеРеквизитыГруппы.Количество() = 0
		И ДополнительныеСведенияГруппы.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	НаборСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ДемоКонтрагенты_Основное;
	НаборОбъект = НаборСсылка.ПолучитьОбъект();
	
	// Перенос дополнительных реквизитов из удаленного набора в новый.
	НаборОбъект.ДополнительныеРеквизиты.Загрузить(ДополнительныеРеквизитыГруппы);
	НаборОбъект.ДополнительныеСведения.Загрузить(ДополнительныеСведенияГруппы);
	
	// Вычисление количества свойств не помеченных на удаление.
	КоличествоРеквизитов = Формат(НаборОбъект.ДополнительныеРеквизиты.НайтиСтроки(
		Новый Структура("ПометкаУдаления", Ложь)).Количество(), "ЧГ=");
	
	КоличествоСведений   = Формат(НаборОбъект.ДополнительныеСведения.НайтиСтроки(
		Новый Структура("ПометкаУдаления", Ложь)).Количество(), "ЧГ=");
	
	НаборОбъект.КоличествоРеквизитов = КоличествоРеквизитов;
	НаборОбъект.КоличествоСведений   = КоличествоСведений;
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НаборОбъект);
	
	// Обновление дополнительных реквизитов.
	Для Каждого Строка Из ДополнительныеРеквизитыГруппы Цикл
		РеквизитОбъект = Строка.Свойство.ПолучитьОбъект();
		РеквизитОбъект.НаборСвойств = НаборСсылка;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(РеквизитОбъект);
	КонецЦикла;
	
	// Обновление дополнительных сведений.
	Для Каждого Строка Из ДополнительныеСведенияГруппы Цикл
		РеквизитОбъект = Строка.Свойство.ПолучитьОбъект();
		РеквизитОбъект.НаборСвойств = НаборСсылка;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(РеквизитОбъект);
	КонецЦикла;
	
	// Заполнение родительского набора.
	НаборСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник__ДемоКонтрагенты;
	НаборОбъект = НаборСсылка.ПолучитьОбъект();
	
	НаборОбъект.ДополнительныеРеквизиты.Загрузить(ДополнительныеРеквизитыГруппы);
	НаборОбъект.ДополнительныеСведения.Загрузить(ДополнительныеСведенияГруппы);
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НаборОбъект);
	
	// Очистка устаревшего набора.
	УстаревшийНабор = Справочники.НаборыДополнительныхРеквизитовИСведений.УдалитьСправочник__ДемоКонтрагенты;
	УстаревшийНаборОбъект = УстаревшийНабор.ПолучитьОбъект();
	УстаревшийНаборОбъект.ДополнительныеРеквизиты.Очистить();
	УстаревшийНаборОбъект.ДополнительныеСведения.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(УстаревшийНаборОбъект);
	
	УправлениеСвойствами.ОбновитьНаименованияНаборовИСвойств();
	
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

// _Демо конец примера

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредопределенныеНаборы()
	
	ПредопределенныеНаборы = Новый Соответствие;
	
	ИменаПредопределенных = Метаданные.Справочники.НаборыДополнительныхРеквизитовИСведений.ПолучитьИменаПредопределенных();
	
	Для каждого Имя Из ИменаПредопределенных Цикл
		ПредопределенныеНаборы.Вставить(
			Имя, УправлениеСвойствамиСлужебный.НаименованиеПредопределенногоНабора(Имя));
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(ПредопределенныеНаборы);
	
КонецФункции

#КонецОбласти

#КонецЕсли
